Revit 2027 API
BuiltInFailures.ElectricalFailures.CannotCreatePanelScheduleDuetoNoDefaultTemplate Property
 A panel schedule cannot be created for these panels. A default panel schedule template must be assigned for this template type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreatePanelScheduleDuetoNoDefaultTemplate { get; }
Public Shared ReadOnly Property CannotCreatePanelScheduleDuetoNoDefaultTemplate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreatePanelScheduleDuetoNoDefaultTemplate {
	FailureDefinitionId^ get ();
}
static member CannotCreatePanelScheduleDuetoNoDefaultTemplate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace